/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: nhwang <nhwang@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/11/01 20:51:32 by nhwang            #+#    #+#             */
/*   Updated: 2022/11/15 20:29:08 by nhwang           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "Zombie.hpp"
////////////////////////////////////////////////
int main()
{
	Zombie	z("foo");
	z.randomChump("foo2");
	std::cout << " ^^^^ randomChump's Scope is done ^^^^ " << std::endl;
	Zombie *z3 = z.newZombie("foo3");//참조형 생성 시 소멸자 보이지 않음 why?? z3의 스코프는 메인이기 때문 힙으로 할당 하는 순간 스코프가 변함을 유의한다
	std::cout << "alive foo3" <<std::endl;
	delete(z3);
	return (0);
}
////////////////////////////////////////////////